mack-hx/2026-Ti/0.2/empty.syscfg
GPIO6.$name                         = "chaosheng";
GPIO6.associatedPins.create(2);
GPIO6.associatedPins[0].$name       = "Trig_B17";
GPIO6.associatedPins[0].ioStructure = "SD";
GPIO6.associatedPins[1].$name       = "Echo_B18";
GPIO6.associatedPins[1].direction   = "INPUT";
GPIO6.associatedPins[1].ioStructure = "SD";

GPIO7.$name                       = "ghuidu";
GPIO7.associatedPins.create(8);
GPIO7.associatedPins[0].$name     = "B25_2";
GPIO7.associatedPins[0].direction = "INPUT";
GPIO7.associatedPins[1].$name     = "A24_4";
GPIO7.associatedPins[1].direction = "INPUT";
GPIO7.associatedPins[2].$name     = "B19_3";
GPIO7.associatedPins[2].direction = "INPUT";
GPIO7.associatedPins[3].$name     = "A14_6";
GPIO7.associatedPins[3].direction = "INPUT";
GPIO7.associatedPins[4].$name     = "A27_1";
GPIO7.associatedPins[4].direction = "INPUT";
GPIO7.associatedPins[5].$name     = "A26_5";
GPIO7.associatedPins[5].direction = "INPUT";
GPIO7.associatedPins[6].$name     = "A07_7";
GPIO7.associatedPins[6].direction = "INPUT";
GPIO7.associatedPins[7].$name     = "B12_8";
GPIO7.associatedPins[7].direction = "INPUT";

GPIO8.$name                              = "key";
GPIO8.associatedPins.create(5);
GPIO8.associatedPins[0].$name            = "K1_B00";
GPIO8.associatedPins[0].direction        = "INPUT";
GPIO8.associatedPins[0].assignedPin      = "00";
GPIO8.associatedPins[0].assignedPort     = "PORTB";
GPIO8.associatedPins[0].pin.$assign      = "PB0";
GPIO8.associatedPins[1].$name            = "K4_B24";
GPIO8.associatedPins[1].direction        = "INPUT";
GPIO8.associatedPins[1].assignedPort     = "PORTB";
GPIO8.associatedPins[1].assignedPin      = "24";
GPIO8.associatedPins[2].direction        = "INPUT";
GPIO8.associatedPins[2].$name            = "K3_A22";
GPIO8.associatedPins[2].assignedPort     = "PORTA";
GPIO8.associatedPins[2].assignedPin      = "22";
GPIO8.associatedPins[3].assignedPort     = "PORTB";
GPIO8.associatedPins[3].assignedPin      = "01";
GPIO8.associatedPins[3].$name            = "K2B_01";
GPIO8.associatedPins[3].direction        = "INPUT";
GPIO8.associatedPins[4].$name            = "USE_key_B21";
GPIO8.associatedPins[4].direction        = "INPUT";
GPIO8.associatedPins[4].assignedPort     = "PORTB";
GPIO8.associatedPins[4].assignedPin      = "21";
GPIO8.associatedPins[4].internalResistor = "PULL_UP";

GPIO9.$name                         = "LED";
GPIO9.associatedPins[0].$name       = "B22";
GPIO9.associatedPins[0].pin.$assign = "PB22";

GPIO10.$name                         = "can";
GPIO10.associatedPins.create(2);
GPIO10.associatedPins[0].$name       = "TX_A12";
GPIO10.associatedPins[1].$name       = "RX_A13";
GPIO10.associatedPins[1].direction   = "INPUT";
GPIO10.associatedPins[1].pin.$assign = "PA13";

I2C1.$name                                   = "MPU9250";
I2C1.basicEnableController                   = true;
I2C1.basicControllerStandardBusSpeed         = "Fast";
I2C1.peripheral.$assign                      = "I2C0";
I2C1.peripheral.sdaPin.$assignAllowConflicts = "PA0";
I2C1.peripheral.sclPin.$assign               = "PA1";
I2C1.sdaPinConfig.hideOutputInversion        = scripting.forceWrite(false);
I2C1.sdaPinConfig.onlyInternalResistor       = scripting.forceWrite(false);
I2C1.sdaPinConfig.passedPeripheralType       = scripting.forceWrite("Digital");
I2C1.sdaPinConfig.$name                      = "ti_driverlib_gpio_GPIOPinGeneric11";
I2C1.sclPinConfig.hideOutputInversion        = scripting.forceWrite(false);
I2C1.sclPinConfig.onlyInternalResistor       = scripting.forceWrite(false);
I2C1.sclPinConfig.passedPeripheralType       = scripting.forceWrite("Digital");
I2C1.sclPinConfig.$name                      = "ti_driverlib_gpio_GPIOPinGeneric12";

I2C2.$name                     = "I2C_1";
I2C2.peripheral.sdaPin.$assign = "PA30";
I2C2.sdaPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric13";
I2C2.sclPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric14";

PWM1.$name                              = "TB6612_PWM";
PWM1.clockDivider                       = 2;
PWM1.timerCount                         = 2000;
PWM1.timerStartTimer                    = true;
PWM1.peripheral.$assign                 = "TIMG12";
PWM1.peripheral.ccp0Pin.$assign         = "PB13";
PWM1.peripheral.ccp1Pin.$assign         = "PA25";
PWM1.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric17";
PWM1.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric18";

SPI1.$name                              = "SPI_LCD";
SPI1.frameFormat                        = "MOTO3";
SPI1.rxFifoThreshold                    = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI1.targetBitRate                      = 2000000;
SPI1.txFifoThreshold                    = "DL_SPI_TX_FIFO_LEVEL_3_4_EMPTY";
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";
SPI1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2";
SPI1.peripheral.$assign                 = "SPI1";
SPI1.peripheral.sclkPin.$assign         = "PB9";
SPI1.peripheral.mosiPin.$assign         = "PB8";
SPI1.peripheral.misoPin.$assign         = "PA16";

SYSCTL.clockTreeEn           = true;
SYSCTL.forceDefaultClkConfig = true;

SYSTICK.periodEnable    = true;
SYSTICK.interruptEnable = true;
SYSTICK.systickEnable   = true;
SYSTICK.period          = 32000;

